In [1]:
import pandas as pd

# create a sample dataframe
data = {'name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
        'age': [25, 30, 35, 40, 45, 50],
        'salary': [50000, 60000, 70000, 80000, 90000, 100000]}
df = pd.DataFrame(data)

# create a pivot table
pivot_table = pd.pivot_table(df, values='salary', index='name', columns='age', aggfunc='sum')

print(pivot_table)

age           25       30       35       40       45        50
name
Alice    50000.0      NaN      NaN  80000.0      NaN       NaN
Bob          NaN  60000.0      NaN      NaN  90000.0       NaN
Charlie      NaN      NaN  70000.0      NaN      NaN  100000.0

In [2]:
pivot_table = pd.pivot_table(df, values='salary', index='name', columns='age', aggfunc='sum').reset_index()

print(pivot_table)

age     name       25       30       35       40       45        50
0      Alice  50000.0      NaN      NaN  80000.0      NaN       NaN
1        Bob      NaN  60000.0      NaN      NaN  90000.0       NaN
2    Charlie      NaN      NaN  70000.0      NaN      NaN  100000.0

In [4]:
pivot_table

age     name       25       30       35       40       45        50
0      Alice  50000.0      NaN      NaN  80000.0      NaN       NaN
1        Bob      NaN  60000.0      NaN      NaN  90000.0       NaN
2    Charlie      NaN      NaN  70000.0      NaN      NaN  100000.0

In [8]:
pivot_table.columns

Index(['name', 25, 30, 35, 40, 45, 50], dtype='object', name='age')

In [9]:
# Group the data by the 'name' column and calculate the mean salary for each group
grouped = df.groupby('name')['salary'].mean()

grouped

name
Alice      65000
Bob        75000
Charlie    85000
Name: salary, dtype: int64

In [10]:
grouped = df.groupby('name')['salary'].mean().reset_index()

grouped

      name  salary
0    Alice   65000
1      Bob   75000
2  Charlie   85000